#+title: Shell
#+startup: show2levels
* Get Mannual for a Command in Shell
Command:
#+begin_src shell
man pwd
#+end_src

#+RESULTS:
#+begin_example
PWD(1)                           User Commands                          PWD(1)

NAME
       pwd - print name of current/working directory

SYNOPSIS
       pwd [OPTION]...

DESCRIPTION
       Print the full filename of the current working directory.

       -L, --logical
              use PWD from environment, even if it contains symlinks

       -P, --physical
              avoid all symlinks

       --help display this help and exit

       --version
              output version information and exit

       If no option is specified, -P is assumed.

       NOTE:  your shell may have its own version of pwd, which usually super‐
       sedes the version described here.  Please refer to your  shell's  docu‐
       mentation for details about the options it supports.

AUTHOR
       Written by Jim Meyering.

REPORTING BUGS
       GNU coreutils online help: <https://www.gnu.org/software/coreutils/>
       Report any translation bugs to <https://translationproject.org/team/>

COPYRIGHT
       Copyright  ©  2020  Free Software Foundation, Inc.  License GPLv3+: GNU
       GPL version 3 or later <https://gnu.org/licenses/gpl.html>.
       This is free software: you are free  to  change  and  redistribute  it.
       There is NO WARRANTY, to the extent permitted by law.

SEE ALSO
       getcwd(3)

       Full documentation <https://www.gnu.org/software/coreutils/pwd>
       or available locally via: info '(coreutils) pwd invocation'

GNU coreutils 8.32               February 2022                          PWD(1)
#+end_example

** Variables and String
To assign variables in bash, use the syntax ~foo=bar~ instead of ~foo = bar~.
#+begin_src shell
foo=bar
echo "$foo"
echo '$foo'
#+end_src

#+RESULTS:
: bar
: $foo

Strings in bash can be defined with ~'~ and ~"~ delimiters, but they are not
equivalent. Strings delimited with ~'~ are literal strings and will not substitute
variables values whereas ~"~ delimited strings will.
** Exit Codes
Commands will often return output and errors. A value of 0 usually means
everything went OK; anything different from 0 means an error occurred.

Exit codes can be used to conditionally execute commands using ~&&~ and
~||~, both of which are *short-circuiting* operators. Commands can also be
separated within the same line using a semicolon ~;~

#+begin_src shell
false || echo "Oops, fail"
true || echo "Will not be printed"
true && echo "Things went well"
false && echo "Will not be printed"
#+end_src

#+RESULTS:
: Oops, fail
: Things went well

** Command Substitution
Another common pattern is wanting to get the output of a command as a
variable. Whenever you place ~$(CMD)~ it will execute ~CMD~ and get the
output of the command and substitute it in place. For example

#+begin_src shell
for file in $(ls); do
    echo "$file"
done
#+end_src

#+RESULTS:
: Missing-Semester.org
: another.txt
: hello.txt

There is another feature called *process substitution*, we use it when we
need to pipe the ~stdout~ of /multiple/ commands.

#+begin_src shell
diff <(ls -a) <(ls)
#+end_src

#+RESULTS:
: 1,2d0
: < .
: < ..
** Basic
The simplest redirection of streams: ~> file~ and ~< file~
#+begin_src shell
echo "Hello World!" > hello.txt
cat < hello.txt
#+end_src

#+RESULTS:
: Hello World!

To copy a file into another:
#+begin_src shell
cat < hello.txt > another.txt
cat < another.txt
#+end_src

#+RESULTS:
: Hello World!

To append something to a file:
#+begin_src shell
echo "This is a message" > hello.txt
cat hello.txt
echo "-------------------------------"
echo "This is another message: Hello!" >> hello.txt
cat hello.txt
#+end_src

#+RESULTS:
: This is a message
: -------------------------------
: This is a message
: This is another message: Hello!

This means, ~> file~ *overwrites* a file while ~>> file~~ *appends* new
content to a file.
** Pipes
The ~|~ operator let us "chain" programs such that the output of one is the
input of another:

#+begin_src shell
ls -l / | tail -n1
echo "-------------------------"
ls -l / | tail -n2
#+end_src

#+RESULTS:
: drwxr-xr-x  13 root root    4096 May  2 05:35 var
: -------------------------
: drwxr-xr-x  14 root root    4096 May  2 05:34 usr
: drwxr-xr-x  13 root root    4096 May  2 05:35 var

